# 設a為輸入值
a = input("請輸入要判斷的數字:")
# 將a轉換為二進位字串b
b = '{0:032b}'.format(int(a))
# 若b第一位為負號，設新變數x將負號轉變為1
if b[0]=="-":
    x = -int(b)+10000000000000000000000000000000
    y = str(x)
    print ("二進位值="+str(x))
    # 設變數i來計算1出現的次數
    i = 0  
    # 設迴圈二進位各值沒歸零則繼續執行
    while y != "00000000000000000000000000000000":
        # 設一遮罩跟y進行位元運算做and比較,判斷最後位是否為1
        if int(y,2) & int('00000000000000000000000000000001',2) == 1:
            i = i+1
        # 進行右移,將比較過的數字去除掉
        y = '{0:032b}'.format(int(y,2)>>1)
    print ("1的數量:"+str(i))
    # 全部32位數減掉1出現的次數為0的各數
    print ("0的數量:"+str(32-i))
else:
    print ("二進位值="+ b)
    # 設變數i來計算1出現的次數
    i = 0
    # 利用for迴圈將字串各值列出
    for y in b:
        # 若出現1時對i+1做紀錄
        if y == "1":
            i=i+1
    print ("1的數量:"+str(i))
    print ("0的數量:"+str(32-i))
# 若二進位的最後位是為0則為偶數
if b[-1] == "0":
    print ("偶數")
else:
    print ("奇數")
