# 輸入要做判斷的浮點數
a = input("請輸入浮點數=")
# 如果字串a裡沒有小數點則判斷為輸入的不是浮點數
if "." not in a:
    print ("你輸入的不是浮點數")
# 若小數點在最後一位 則判斷小數點後沒數字
elif "." == a[-1]:
    print ("小數點後沒有數字")
# 若字串第零位與+相等判斷為正數 
elif a[0] == "+":
    print ("浮點數是正數")
    i=-1
    for x in a:  # 用迴圈將a列出
        i=i+1
        if x == ".":  # 當x與"."相等時 i值會等於"."所在位置
            b=len(a)-i-1  #設b為除去正號的字串長度
            print ("小數點前面有"+str(i-1)+"位")
            print ("小數點後面有"+str(b)+"位")
# 若字串第零位與-相等判斷為負數
elif a[0] == "-":
    print ("浮點數是負數")
    i=-1
    for x in a:  # 用迴圈將a列出
        i=i+1
        if x == ".":  # 當x與"."相等時 i值會等於"."所在位置
            b=len(a)-i-1  #設b為除去正號的字串長度
            print ("小數點前面有"+str(i-1)+"位")
            print ("小數點後面有"+str(b)+"位")
# 若字串第零位無正負號 則提醒忘記輸入正負號 並改變計算方式
else:
    print ("你忘記輸入正負號")
    i=-1
    for x in a:  # 用迴圈將a列出
        i=i+1
        if x == ".":  # 當x與"."相等時 i值會等於"."所在位置
            b=len(a)-i-1  # 設b為字串長度
            print ("小數點前面有"+str(i)+"位")
            print ("小數點後面有"+str(b)+"位")
